DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvCAN.c
/*---------------------------------------------------------------------------------------------------------*/
/*                                                                                                         */
/* Copyright (c) Nuvoton Technology Corp. All rights reserved.                                             */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
#include <stdio.h>

/*---------------------------------------------------------------------------------------------------------*/
/* Includes of headers                                                                                     */
/*---------------------------------------------------------------------------------------------------------*/
#include "NUC100.h"
#include "Driver\DrvCAN.h"
#include "Driver\DrvSYS.h"

/*---------------------------------------------------------------------------------------------------------*/
/* Macro, type and constant definitions                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
static PFN_DRVCAN_CALLBACK *g_pfnCAN0callback = NULL;
static PFN_DRVCAN_CALLBACK *g_pfnCAN1callback = NULL;

/*---------------------------------------------------------------------------------------------------------*/
/* CAN0 ISR                                                                                         	   */
/*---------------------------------------------------------------------------------------------------------*/
void CAN0_IRQHandler(void)
{
 	
	if(CAN0->INTR.BEI ==1)		/* Bus Error Interrupt */
	{
		CAN0->INTR.BEI =1 ; 							/* Clear Bus Error Interrupt Flag */			

        if (g_pfnCAN0callback != NULL)                  /* Bus Error Interrupt Callback Function */          
     	   g_pfnCAN0callback(INT_BEI);
  	}
				   
	if(CAN0->INTR.ALI ==1)		/* Arbitration Lost Interrupt */
	{
		CAN0->INTR.ALI =1 ; 						   	/* Clear Arbitration Lost Interrupt Flag */

        if (g_pfnCAN0callback != NULL)                  /* Arbitration Lost Interrupt Callback Function */            
     	   g_pfnCAN0callback(INT_ALI);
  	}			   
	
	if(CAN0->INTR.WUI ==1)		/* Wake-Up Interrupt */
	{												  	
		CAN0->INTR.WUI =1 ; 						  	/* Clear Wake-Up Interrupt Flag */

        if (g_pfnCAN0callback != NULL)              	/* Wake-Up Interrupt Callback Function */               
     	   g_pfnCAN0callback(INT_WUI);
  	}			   
	if(CAN0->INTR.TI ==1)	 	/* Transmit Interrupt */
	{
		CAN0->INTR.TI =1 ; 							   	/* Clear Transmit Interrupt Flag */

        if (g_pfnCAN0callback != NULL)                  /* Transmit Interrupt Callback Function */           
     	   g_pfnCAN0callback(INT_TI);				  	
  	}			   
	if(CAN0->INTR.RI ==1)		/* Receive Interrupt */
	{
		CAN0->INTR.RI =1 ; 							  	/* Clear Receive Interrupt Flag */

        if (g_pfnCAN0callback != NULL)                  /* Receive Interrupt Callback Function */
     	   g_pfnCAN0callback(INT_RI);
  	}			   
}

/*---------------------------------------------------------------------------------------------------------*/
/* CAN1 ISR                                        														   */
/*---------------------------------------------------------------------------------------------------------*/

void CAN1_IRQHandler(void)
{
 	if(CAN1->INTR.BEI ==1)		/* Bus Error Interrupt */
	{
		CAN1->INTR.BEI =1 ; 						  	/* Clear Bus Error Interrupt Flag */

        if (g_pfnCAN1callback != NULL)                  /* Bus Error Interrupt Callback Function */ 
     	   g_pfnCAN1callback(INT_BEI);
  	}			   

	if(CAN1->INTR.ALI ==1)	   	/* Arbitration Lost Interrupt */
	{
		CAN1->INTR.ALI =1 ; 						  	/* Clear Arbitration Lost Interrupt Flag */

        if (g_pfnCAN1callback != NULL)                  /* Arbitration Lost Interrupt Callback Function */ 
     	   g_pfnCAN1callback(INT_ALI);
  	}			   

	if(CAN1->INTR.WUI ==1)	   	/* Wake-Up Interrupt */
	{												   	/* Clear Wake-Up Interrupt Flag */
		CAN1->INTR.WUI =1 ; 

        if (g_pfnCAN1callback != NULL)                  /* Wake-Up Interrupt Callback Function */ 
     	   g_pfnCAN1callback(INT_WUI);
  	}			   
	if(CAN1->INTR.TI ==1)	   	/* Transmit Interrupt */
	{												  	
		CAN1->INTR.TI =1 ; 							   	/* Clear Transmit Interrupt Flag */

        if (g_pfnCAN1callback != NULL)                  /* Transmit Interrupt Callback Function */ 
     	   g_pfnCAN1callback(INT_TI);
  	}			   
	if(CAN1->INTR.RI ==1)		/* Receive Interrupt */
	{												 	
		CAN1->INTR.RI =1 ; 						   		/* Clear Receive Interrupt Flag */

        if (g_pfnCAN1callback != NULL)                  /* Receive Interrupt Callback Function */
     	   g_pfnCAN1callback(INT_RI);
  	}	

}

/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvCAN_Init		                                                                   	   */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               None                                                                                      */
/*                                                                                                         */
/* Returns:                                                                                                */
/*               None                                                                                      */
/* Description:                                                                                            */
/*               The function is used to intialize CAN0 and CAN1                                           */
/*---------------------------------------------------------------------------------------------------------*/
void DrvCAN_Init(void)
{
	SYS->IPRSTC2.CAN0_RST =1;  /* Reset CAN0 */
	SYS->IPRSTC2.CAN0_RST =0;
	SYS->IPRSTC2.CAN1_RST =1;  /* Reset CAN1 */
	SYS->IPRSTC2.CAN1_RST =0;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvCAN_Open		                                                                   	   */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               port  		-[in]   		 CAN Channel:  CAN_PORT0 / CAN_PORT1                           */
/*               Clock  	-[in]            BitRate(KB): BITRATE_100K_6M/BITRATE_500K_6M/BITRATE_1000K_6M */
/*                                           		   BITRATE_100K_12M/BITRATE_500K_12M/BITRATE_1000K_12M */
/*                                                     BITRATE_100K_24M/BITRATE_500K_24M/BITRATE_1000K_24M */
/*                                                     BITRATE_100K_48M/BITRATE_500K_48M/BITRATE_1000K_48M */
/*                                                     or Userself configure value                         */
/*                                                                                                         */
/*               IsUserSet	-[in]            Decide configure by user self or configure table              */
/*                                           TRUE: 	Configure by function table                            */
/*                                           FALSE: Configure by user self                                 */
/* Returns:                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*               The function is used to configure CAN intial setting                                      */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvCAN_Open(CAN_PORT port,uint32_t u32Reg)
{
	/* Enable APB CLK & CAN BUS & IP Reset */
	UNLOCKREG();
	if(port == CAN_PORT0)
	{
		SYSCLK->APBCLK.CAN0_EN 	= 1;
		SYS->IPRSTC2.CAN0_RST 	= 1;
		SYS->IPRSTC2.CAN0_RST 	= 0;
		SYS->GPDMFP.CAN0_TX   	= 1;
		SYS->GPDMFP.CAN0_RX   	= 1;
		CAN0->CMD.CAN_EN 		= 1;
	}
	else if(port == CAN_PORT1)
	{
		SYSCLK->APBCLK.CAN1_EN 	= 1;
		SYS->IPRSTC2.CAN1_RST 	= 1;
		SYS->IPRSTC2.CAN1_RST 	= 0;
		SYS->GPDMFP.CAN1_TX   	= 1;
		SYS->GPDMFP.CAN1_RX   	= 1;
		CAN1->CMD.CAN_EN 		= 1;
	}
	LOCKREG();
	
