DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvCAN.c
	/* Bit Time Control Register Setting */
	/* Using Configure Table to decide */
	if(port == DRVCAN_PORT0)
		outpw(&CAN0->BTIMR,u32Reg);
	else
		outpw(&CAN1->BTIMR,u32Reg);
	return E_SUCCESS;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvCAN_WaitReady                                                                   	   */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               port  		-[in]   		 CAN Channel:  CAN_PORT0 / CAN_PORT1                           */
/*                                                                                                         */
/* Returns:                                                                                                */
/*               E_SUCCESS   				Success                                                        */
/*               E_DRVCAN_ERR_ARGUMENT      Invalid Argument                                               */
/*               E_DRVCAN_ERR_TIMEOUT       Time-Out                                                       */
/* Description:                                                                                            */
/*               The function is used to check bus is idle                                                 */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvCAN_WaitReady(CAN_PORT port)
{
	volatile uint32_t u32SFR;
	volatile int32_t timeout1,timeout2;
		
	if(port == CAN_PORT0)
	{	
		
		timeout1 =1000;
	
		while(1)
		{
			u32SFR = CAN0->BSR.BS;
			if(u32SFR ==1)        			/* BUS is idle */
				break;
		
			timeout1--;
			if(timeout1==0)					/* Time-Out */
				return E_DRVCAN_ERR_TIMEOUT;
		}

	}
	else if(port == CAN_PORT1)
	{
		timeout2 =1000;
		
		while(1)
		{

			u32SFR = CAN0->BSR.BS;
			if(u32SFR ==1)        			/* BUS is idle */
				break;
		
			timeout2--;
			if(timeout2==0)					/* Time-Out */
				return E_DRVCAN_ERR_TIMEOUT;
		}
	}
	else
		return E_DRVCAN_ERR_ARGUMENT;

	return E_SUCCESS;
}



/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvCAN_Close                                                                   	       */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               port  		-[in]   		 CAN Channel:  CAN_PORT0 / CAN_PORT1                           */
/* Returns:                                                                                                */
/*               E_SUCCESS   				Success                                                        */
/*               E_DRVCAN_ERR_PORT_INVALID  Invalid Port                                                   */
/* Description:                                                                                            */
/*               To disable the CAN APB Clock and BUS Enable                                               */
/*---------------------------------------------------------------------------------------------------------*/

int32_t DrvCAN_Close(CAN_PORT port)
{
	/*Enable APB CLK & CAN BUS*/

	if(port == CAN_PORT0)
	{
		SYSCLK->APBCLK.CAN0_EN =0;
		CAN0->CMD.CAN_EN =0;
	
	}
	else if(port == CAN_PORT1)
	{
		SYSCLK->APBCLK.CAN1_EN =0;
		CAN1->CMD.CAN_EN =0;
	}
	else
		return E_DRVCAN_ERR_PORT_INVALID;

	return E_SUCCESS;

}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvCAN_WriteMsg                                                                   	       */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               port  		-[in]   		 CAN Channel:  CAN_PORT0 / CAN_PORT1                           */
/*               Msg     	-[in]   	     Sturcture of CAN                                              */
/*                                                                                                         */
/* Returns:                                                                                                */
/*               E_SUCCESS   				Success                                                        */
/*               E_DRVCAN_ERR_TIMEOUT  		Time-Out                                                       */
/*               E_DRVCAN_ERR_PORT_INVALID	Invalid port                                                   */
/*                                                                                                         */
/* Description:                                                                                            */
/*               The function is set CAN information and send to CAN BUS                                   */
/*---------------------------------------------------------------------------------------------------------*/

int32_t DrvCAN_WriteMsg(CAN_PORT port,STR_CAN_T *Msg)
{
	
	if(port == CAN_PORT0)
	{
		int32_t timeout1 = 1000;
	
		/* Check Busy is idle */		
		while(CAN0->BSR.BS == 0)		
		{
			timeout1--;
			if(timeout1==0)				/* TimeOut */
			{
				printf("Time-Out\n");
				return E_DRVCAN_ERR_TIMEOUT;
			}
		}
		
		/* Configure Setting */		
		CAN0->TXID.TXID 		= Msg->id;

		CAN0->TXFINFO.TXDLC		= Msg->u8cLen;
		
		CAN0->TXDATA[0] 		= Msg->u32cData[0];
		
		CAN0->TXDATA[1] 		= Msg->u32cData[1];

		CAN0->TXFINFO.TXFF 		= Msg->u8cFormat;

		CAN0->TXFINFO.TXRTR 	= Msg->u8cType;
		
		CAN0->CMD.OVERFLOAD_EN 	= Msg->u8cOverLoad;

