DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvCAN.c
		/* Trigger and Send */
		CAN0->CMD.TR = 1; 

		/* Transfer Complete */
		while(CAN0->BSR.TCS != 1); 		

	}
	else if(port == CAN_PORT1)
	{

		int32_t timeout2 = 1000;

		/* Check Busy is idle */
		while(CAN1->BSR.BS == 1)
		{
			printf("BUS is Busy");
			
			timeout2--;
			if(timeout2==0)					 /* TimeOut */
				return E_DRVCAN_ERR_TIMEOUT;
		}
		
		/* Configure Setting */		
		CAN1->TXID.TXID 		= Msg->id;

		CAN1->TXFINFO.TXDLC		= Msg->u8cLen;
		
		CAN1->TXDATA[0] 		= Msg->u32cData[0];
		
		CAN1->TXDATA[1] 		= Msg->u32cData[1];

		CAN1->TXFINFO.TXFF 		= Msg->u8cFormat;
		
		CAN1->TXFINFO.TXRTR 	= Msg->u8cType;
		
		CAN1->CMD.OVERFLOAD_EN 	= Msg->u8cOverLoad;

		/* Trigger and Send */
		CAN1->CMD.TR = 1; 
		
		/* Transfer Complete */
		while(CAN1->BSR.TCS != 1); 		 	
	}
	else
	 	return E_DRVCAN_ERR_PORT_INVALID;
	
	return E_SUCCESS;
}		  

/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvCAN_ReadMsg                                                                   	       */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               port  		-[in]   		 CAN Channel:  CAN_PORT0 / CAN_PORT1                           */
/* Returns:                                                                                                */
/*               STR_CAN_T  -[out]           The stucture of CAN                                           */
/*                                                                                                         */
/* Description:                                                                                            */
/*               The function is used to get CAN RX information                                            */
/*---------------------------------------------------------------------------------------------------------*/

STR_CAN_T DrvCAN_ReadMsg(CAN_PORT port)
{
	STR_CAN_T recCAN;

	if(port == CAN_PORT0)
	{
		/* Wait Receiving */
		while(CAN0->BSR.RS == 1);

		recCAN.id 			= CAN0->RXID.RXID;
	 	recCAN.u8cLen 		= CAN0->RXFINFO.RXDLC; 
		recCAN.u8cFormat	= CAN0->RXFINFO.RXIDE; 
		recCAN.u8cType		= CAN0->RXFINFO.RXRTR; 

		recCAN.u32cData[0] 	= CAN0->RX_DATA[0] ; 
		recCAN.u32cData[1] 	= CAN0->RX_DATA[1] ; 

	}
	else if(port == CAN_PORT1)
	{
		/* Wait Receiving */
		while(CAN1->BSR.RS == 1);

		recCAN.id 			= CAN1->RXID.RXID;
	 	recCAN.u8cLen 		= CAN1->RXFINFO.RXDLC; 
		recCAN.u8cFormat	= CAN1->RXFINFO.RXIDE; 
		recCAN.u8cType		= CAN1->RXFINFO.RXRTR; 

		recCAN.u32cData[0] 	= CAN1->RX_DATA[0] ; 
		recCAN.u32cData[1] 	= CAN1->RX_DATA[1] ; 
	}
	
 	return recCAN;
}		  

/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvCAN_EnableInt                                                                   	   */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               port  			  -[in]	  CAN Channel:  CAN_PORT0 / CAN_PORT1                              */
/*               u32InterruptFlag -[in]   Interrupt Flag:It could be INT_BEI/INT_ALI/INT_WUI/INT_TI/INT_RI */
/*                                                 INT_BEI:                                                 */
/*                                                 INT_ALI:                                                 */
/*                                                 INT_WUI:                                                 */
/*                                                 INT_TI :                                                 */
/*                                                 INT_RI :                                                 */
/*                                                                                                         */
/*               pfncallback                  Callback function pointer                                    */
/*                                                                                                         */
/* Returns:                                                                                                */
/*                                                                                                         */
/* Side effects:                                                                                           */
/*                                                                                                         */
/* Description:                                                                                            */
/*               The function is used to enable CAN Interrupt and install the call back function           */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvCAN_EnableInt(CAN_PORT port,int32_t u32InterruptFlag,PFN_DRVCAN_CALLBACK pfncallback)
{
	
	if(port == CAN_PORT0)
	{
		outpw(CAN0_BASE+0x10, (M32(CAN0_BASE+0x10) & ~(INT_BEI | INT_ALI | INT_WUI | INT_TI | INT_RI )) | 
		(u32InterruptFlag & (INT_BEI | INT_ALI | INT_WUI | INT_TI | INT_RI )));
		g_pfnCAN0callback = pfncallback;        
		NVIC_EnableIRQ(CAN0_IRQn); 
	
	}
	else if(port == CAN_PORT1)
	{
		outpw(CAN1_BASE+0x10, (M32(CAN0_BASE+0x10) & ~(INT_BEI | INT_ALI | INT_WUI | INT_TI | INT_RI )) | 
		(u32InterruptFlag & (INT_BEI | INT_ALI | INT_WUI | INT_TI | INT_RI )));
		g_pfnCAN1callback = pfncallback;        
		NVIC_EnableIRQ(CAN1_IRQn); 
	}
	else
	{
	}
	return TRUE;

}



/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvUART_DisableInt                                                                   	   */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               port  			  	-[in]	  CAN Channel:  CAN_PORT0 / CAN_PORT1                          */
/*               u32InterruptFlag             INT_BEI/INT_ALI/INT_WUI/INT_TI/INT_RI                        */
/* Returns:                                                                                                */
/*                                                                                                         */
/* Side effects:                                                                                           */
/*                                                                                                         */
/* Description:                                                                                            */
/*               The function is used to disable CAN Interrupt and uninstall the call back function        */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvCAN_DisableInt(CAN_PORT port,int32_t u32InterruptFlag)
{

	switch (port)
    {
        case CAN_PORT0:
			g_pfnCAN0callback = NULL;
			outpw(&CAN0->INTEN,inpw(&CAN0->INTEN)&~u32InterruptFlag);
            NVIC_DisableIRQ(CAN0_IRQn);   
            break;

        case CAN_PORT1:
			g_pfnCAN1callback = NULL;
			outpw(&CAN1->INTEN,inpw(&CAN1->INTEN)&~u32InterruptFlag);
           	NVIC_DisableIRQ(CAN1_IRQn);    
            break;

        default:
			return E_DRVCAN_ERR_PORT_INVALID;
   }

	return E_SUCCESS;

