DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvCAN.c
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvCAN_GetErrorStatus                                                                	   */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               port  			  -[in]	  CAN Channel:  CAN_PORT0 / CAN_PORT1                              */
/*               DRVCAN_ERRFLAG   -[in]   Bus Error Flag - It includes of           			           */
/*                                            DRVCAN_ERRSTUFF :  Stuff Error                               */
/*                                            DRVCAN_ERRFORM  :  Form Error                                */
/*                                            DRVCAN_ERRCRC   :  CRC Error                                 */
/*                                            DRVCAN_ERRACK   :  Acknowledge Error                         */
/*                                            DRVCAN_ERRBIT   :  Bit Error                                 */
/* Returns:                                                                                                */
/*               TRUE  : The Error Flag is set                                                             */
/*               FALSE : The Error Flag is clear                                                           */
/*               E_DRVCAN_ERR_PORT_INVALID : Error Port Setting                                            */
/* Side effects:                                                                                           */
/*                                                                                                         */
/* Description:                                                                                            */
/*               The function is used to Get CAN Error Status				       						   */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvCAN_GetErrorStatus(CAN_PORT port,DRVCAN_ERRFLAG u32ErrorFlag)
{
	
	if(port == CAN_PORT0)
	{
		switch(u32ErrorFlag)
		{
			case DRVCAN_ERRSTUFF:
				if(CAN0->ERRCR.STUFF_ERR)	
					return TRUE;
				break;
	
			case DRVCAN_ERRFORM:
				if(CAN0->ERRCR.FORM_ERR)	
					return TRUE;
				break;

			case DRVCAN_ERRCRC:
				if(CAN0->ERRCR.CRC_ERR)	
					return TRUE;
				break;
			  
			case DRVCAN_ERRACK:
				if(CAN0->ERRCR.ACK_ERR)	
					return TRUE;
				break;
			
			case DRVCAN_ERRBIT:
				if(CAN0->ERRCR.BIT_ERR)	
					return TRUE;
				break;

			default:
				break;
		}
	}
	else if(port == CAN_PORT1)
	{
		switch(u32ErrorFlag)
		{
			case DRVCAN_ERRSTUFF:
				if(CAN1->ERRCR.STUFF_ERR)	
					return TRUE;
				break;
	
			case DRVCAN_ERRFORM:
				if(CAN1->ERRCR.FORM_ERR)	
					return TRUE;
				break;

			case DRVCAN_ERRCRC:
				if(CAN1->ERRCR.CRC_ERR)	
					return TRUE;
				break;
			  
			case DRVCAN_ERRACK:
				if(CAN1->ERRCR.ACK_ERR)	
					return TRUE;
				break;
			
			case DRVCAN_ERRBIT:
				if(CAN1->ERRCR.BIT_ERR)	
					return TRUE;
				break;

			default:
				break;
		}
	}
	else
	{
		return E_DRVCAN_ERR_PORT_INVALID;	
	}
	
	return E_SUCCESS;
}




/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvCAN_SetAcceptanceFilter                                                            	   */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               port  		-[in]   		 CAN Channel:  CAN_PORT0 / CAN_PORT1                           */
/*               id_Filter  -[in]            The data to write to the specified ID Filter                  */
/*                                                                                                         */
/* Returns:                                                                                                */
/*               E_SUCCESS                   SUCCSSS                                                       */
/*               E_DRVCAN_ERR_PORT_INVALID   Error Port Setting                                            */
/* Description:                                                                                            */
/*               The function is used to Set a Accept ID filter                                            */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvCAN_SetAcceptanceFilter(CAN_PORT port,int32_t id_Filter )
{
	if(port == CAN_PORT0 )
	{
		CAN0->ACR.ACR =id_Filter;	
	}
	else if(port == CAN_PORT1)
	{
		CAN1->ACR.ACR =id_Filter;		
	}
	else
	{
		return E_DRVCAN_ERR_PORT_INVALID;
	}
	return E_SUCCESS;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvCAN_SetMaskFilter                                                                 	   */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               port  		-[in]   		 CAN Channel:  CAN_PORT0 / CAN_PORT1                           */
/*               id_Filter  -[in]            The data to write to the specified Mask Filter                */
/* Returns:                                                                                                */
/*               E_SUCCESS                   SUCCSSS                                                       */
/*               E_DRVCAN_ERR_PORT_INVALID   Error Port Setting                                            */
/* Description:                                                                                            */
/*               The function is used to set mask ID filter                                                */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvCAN_SetMaskFilter(CAN_PORT port,int32_t id_Filter )
{
	if(port == CAN_PORT0 )
	{
		CAN0->AMR.AMR =id_Filter;	
	}
	else if(port == CAN_PORT1)
	{
		CAN1->AMR.AMR =id_Filter;		
	}
	else
	{
		return E_DRVCAN_ERR_PORT_INVALID;
	}
	return E_SUCCESS;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvCAN_EnableInt                                                                   	   */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               port  			  -[in]	  CAN Channel:  CAN_PORT0 / CAN_PORT1                              */
/*               i8SynJumpWidth   -[in]   Synchronization Jump Width :It could be 0~3                      */
/*               i16TimeSeg1      -[in]   Time Segment 1:It could be 0~31                                  */
/*               i8TimeSeg2       -[in]   Time Segment 2 :It could be 0~15                                 */
/*               SampPtNo         -[in]   Sampling Point Number :It could be 0~1                           */
/*                                                                                                         */
/* Returns:                                                                                                */
/*                                                                                                         */
/* Side effects:                                                                                           */
/*                                                                                                         */
/* Description:                                                                                            */
/*               The function is used to Set CAN Bus Timming Parameter                                     */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvCAN_SetBusTiming(
	CAN_PORT port,
	int8_t i8SynJumpWidth,
	int16_t i16TimeSeg1,
	int8_t i8TimeSeg2,
	int8_t SampPtNo
)
{
	if((i8SynJumpWidth>3) || (i16TimeSeg1 >31 || (i8TimeSeg2 > 15) || (SampPtNo >1)))
	{
	   return E_DRVCAN_ERR_ARGUMENT;
	}

	if(port == CAN_PORT0)
	{
	   CAN0->BTIMR.SJW 		= i8SynJumpWidth;
	   CAN0->BTIMR.TSEG1 	= i16TimeSeg1;
	   CAN0->BTIMR.TSEG2 	= i8TimeSeg2;
	   CAN0->BTIMR.SAMP 	= SampPtNo;
	}
	else if(port == CAN_PORT1)
	{								   
	   CAN1->BTIMR.SJW 		= i8SynJumpWidth;
	   CAN1->BTIMR.TSEG1 	= i16TimeSeg1;
	   CAN1->BTIMR.TSEG2 	= i8TimeSeg2;
	   CAN1->BTIMR.SAMP 	= SampPtNo;
	}
	else
	{
		return E_DRVCAN_ERR_ARGUMENT;
	}
	return E_SUCCESS;

