DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvCAN.c
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvCAN_GetClock                                                                 	       */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               None                                                                                      */
/* Returns:                                                                                                */
/*               Current CAN Clock                                                                         */
/* Description:                                                                                            */
/*               The function is used to Get CAN Clock                                                     */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvCAN_GetClock(void)
{
	uint32_t clk =0 , div;
											/* Check UART Clock Source Setting */
	if(SYSCLK->CLKSEL1.CAN_S == 0)			
	{
		clk = DrvSYS_GetEXTClock();			/* Get External Clock From DrvSYS Setting */
	}
	else if(SYSCLK->CLKSEL1.CAN_S == 0)
	{
	 	div = SYSCLK->CLKDIV.CAN_N;			/* According PLL Clock and UART_Divider to get clock */
	
		clk = DrvSYS_GetPLLClock() / (div+1);
	}
	else
		clk = 22000000;						/* Clock 22Mhz  */

	return clk;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvCAN_GetVersion                                                                         */
/*                                                                                                         */
/* Parameter:        																					   */	
/*	             None                                                                                 	   */
/* Returns:                                                                                                */
/*               Version Number                                                                            */
/* Description:                                                                                            */
/*               The function is used to get DrvCAN Version Number                                         */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvCAN_GetVersion(void)
{
	return DRVCAN_VERSION_NUM;
	
}



